Revit 2016 API
PlumbingUtils Members
The PlumbingUtils type exposes the following members.
Methods
Name | Description
ConnectPipePlaceholdersAtCross(Document, ElementId, ElementId)
 Connects placeholders that looks like Cross connection.
ConnectPipePlaceholdersAtCross(Document, ElementId, ElementId, ElementId)
 Connects placeholders that looks like Cross connection.
ConnectPipePlaceholdersAtCross(Document, Connector, Connector, Connector, Connector)
 Connects placeholders that looks like Cross connection.
ConnectPipePlaceholdersAtElbow(Document, Connector, Connector)
 Connects placeholders that looks like elbow connection.
ConnectPipePlaceholdersAtElbow(Document, ElementId, ElementId)
 Connects placeholders that looks like elbow connection.
ConnectPipePlaceholdersAtTee(Document, ElementId, ElementId)
 Connects two placeholders that looks like Tee connection.
ConnectPipePlaceholdersAtTee(Document, Connector, Connector, Connector)
 Connects three placeholders that looks like Tee connection.
ConvertPipePlaceholders
 Converts a collection of pipe placeholder elements into pipe elements.
HasOpenConnector
 Checks if there is open piping connector for the given element - object of pipe curve, pipe fitting or pipe accessory.
PlaceCapOnOpenEnds
 Places caps on the open connectors of the pipe curve, pipe fitting or pipe accessory.
See Also
PlumbingUtils Class
Autodesk.Revit.DB.Plumbing Namespace